package com.mujakjung.global.enums;

import lombok.Getter;

@Getter
public enum Region {
    SEOUL("서울특별시", new String[]{"강남구", "강동구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중랑구"}),
    BUSAN("부산광역시", new String[]{"강서구", "금정구", "기장군", "남구", "동구", "동래구", "북구", "사상구", "사하구", "서구", "수영구", "연제구", "영도구", "중구", "해운대구"}),
    DAEGU("대구광역시", new String[]{"남구", "달서구", "달성군", "동구", "북구", "서구", "수성구", "중구"}),
    INCHEON("인천광역시", new String[]{"강화군", "계양구", "남동구", "동구", "미추홀구", "부평구", "서구", "연수구", "옹진군", "중구"}),
    GWANGJU("광주광역시", new String[]{"광산구", "남구", "동구", "북구", "서구"}),
    DAEJEON("대전광역시", new String[]{"대덕구", "동구", "서구", "유성구", "중구"}),
    ULSAN("울산광역시", new String[]{"남구", "동구", "북구", "울주군", "중구"}),
    SEJONG("세종특별자치시", new String[]{"세종시"}),
    GYEONGGI("경기도", new String[]{"고양시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시", "동두천시", "부천시", "성남시", "수원시", "시흥시", "안산시", "안성시", "양주시", "여주시", "연천군", "오산시", "용인시", "의왕시", "의정부시", "이천시", "파주시", "평택시", "하남시", "화성시"}),
    GANGWON("강원도", new String[]{"강릉시", "고성군", "동해시", "삼척시", "속초시", "원주시", "인제군", "정선군", "철원군", "춘천시", "태백시", "평창군", "홍천군", "화천군", "횡성군"}),
    CHUNGCHEONGBUK("충청북도", new String[]{"괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천시", "증평군", "진천군", "청주시", "충주시"}),
    CHUNGCHEONGNAM("충청남도", new String[]{"계룡시", "공주시", "금산군", "논산시", "당진시", "보령시", "서산시", "아산시", "연기군", "예산군", "천안시", "청양군", "태안군", "홍성군"}),
    JEOLLABUK("전라북도", new String[]{"고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군", "완주군", "익산시", "전주시", "정읍시", "진안군"}),
    JEOLLANAM("전라남도", new String[]{"강진군", "고흥군", "곡성군", "광양시", "구례군", "나주시", "담양군", "목포시", "무안군", "보성군", "순천시", "신안군", "여수시", "영광군", "영암군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군", "화순군"}),
    GYEONGBUK("경상북도", new String[]{"경산시", "경주시", "고령군", "구미시", "군위군", "기초시", "문경시", "봉화군", "상주시", "안동시", "영덕군", "영양군", "영주시", "영천시", "예천군", "울진군", "울릉군", "청송군", "청도군", "칠곡군"}),
    GYEONGNAM("경상남도", new String[]{"김해시", "마산시", "밀양시", "사천시", "양산시", "의령군", "진주시", "창원시", "통영시", "함안군", "함양군", "하동군", "거창군", "합천군"}),
    JEJU("제주특별자치도", new String[]{"서귀포시", "제주시"});

    private final String name;
    private final String[] districts;

    Region(String name, String[] districts) {
        this.name = name;
        this.districts = districts;
    }

    public static Region fromString(String regionName) {
        for (Region region : Region.values()) {
            if (region.getName().equals(regionName)) {
                return region;
            }
        }
        throw new IllegalArgumentException("Unknown region: " + regionName);
    }

}